2021-11-19-ArraysII/ArraysII.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-18 Thu 19:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Program for class arrays II + pointers</title>
<meta name="author" content="William Oquendo" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Program for class arrays II + pointers</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgedb2f0f">1. <span class="todo TODO">TODO</span> Basic arrays again</a></li>
<li><a href="#orgba127f4">2. <span class="todo TODO">TODO</span> Pointers basic <code>[/]</code></a></li>
<li><a href="#orgadca18a">3. <span class="todo TODO">TODO</span> Passing arrays to functions <code>[0/3]</code></a></li>
<li><a href="#orgc99ba97">4. <span class="todo TODO">TODO</span> Talk about dynamic memory <code>[/]</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-orgedb2f0f" class="outline-2">
<h2 id="orgedb2f0f"><span class="section-number-2">1.</span> <span class="todo TODO">TODO</span> Basic arrays again</h2>
<div class="outline-text-2" id="text-1">
<p>
An array
</p>
<ul class="org-ul">
<li>is a contigous and homogeneous block of memory</li>
<li>can be static (size known already when compiling, limited by stack size) or
dynamic (size known in runtime, size limited by heap size)</li>
<li>can be initialized from the beginning : <code class="src src-cpp"><span style="color: #6ae4b9;">double</span> <span style="color: #00d3d0;">data</span><span style="color: #ffffff;">[</span>N<span style="color: #ffffff;">]{</span><span style="color: #00bcff;">1</span><span style="color: #ffffff;">}</span>;</code> will make
the first element equal to 1 and the remaining equal to 0.</li>
</ul>

<p>
<b>Always compile with sanitizers <code>-sanitize=address -fsanitize=undefined
-fsanitize=leak</code></b>
</p>


<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">Computing dot product</span>
<span style="color: #ff9077;">#include</span> <span style="color: #ffffff;">&lt;</span><span style="color: #79a8ff;">iostream</span><span style="color: #ffffff;">&gt;</span>

<span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">argc</span>, <span style="color: #6ae4b9;">char</span> **<span style="color: #00d3d0;">argv</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">{</span>
    <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">double x1 = 9.87, y1 = -0.65, z1 = 7.65432;</span>
    <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">double x2 = -5.432, y2 = -0.6598876, z2 = -0.64359;</span>
    <span style="color: #a8a8a8;">//</span><span style="color: #a8a8a8;">std::cout &lt;&lt; x1*x2 + y1*y2 + z1*z2 &lt;&lt; std::endl;</span>

    <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">memoria = stack(estatico) + heap(dinamica)</span>

    <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">primitive arrays //limited by stack size</span>
    <span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">N</span> = <span style="color: #00bcff;">10000</span>;
    <span style="color: #6ae4b9;">double</span> <span style="color: #00d3d0;">v1</span><span style="color: #ff62d4;">[</span>N<span style="color: #ff62d4;">]{</span><span style="color: #00bcff;">9.87</span>, -<span style="color: #00bcff;">0.65</span>, <span style="color: #00bcff;">7.65432</span><span style="color: #ff62d4;">}</span>, <span style="color: #00d3d0;">v2</span><span style="color: #ff62d4;">[</span>N<span style="color: #ff62d4;">]{</span>-<span style="color: #00bcff;">5.432</span>, -<span style="color: #00bcff;">0.6598876</span>, -<span style="color: #00bcff;">0.64359</span><span style="color: #ff62d4;">}</span>;
    <span style="color: #6ae4b9;">double</span> <span style="color: #00d3d0;">dot</span> = <span style="color: #00bcff;">0</span>;
    <span style="color: #b6a0ff;">for</span> <span style="color: #ff62d4;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">ii</span> = <span style="color: #00bcff;">0</span>; ii &lt; N; ii++<span style="color: #ff62d4;">)</span> <span style="color: #ff62d4;">{</span>
        dot += v1<span style="color: #3fdfd0;">[</span>ii<span style="color: #3fdfd0;">]</span>*v2<span style="color: #3fdfd0;">[</span>ii<span style="color: #3fdfd0;">]</span>;
    <span style="color: #ff62d4;">}</span>
    <span style="color: #00bcff;">std</span>::cout &lt;&lt; dot &lt;&lt; <span style="color: #00bcff;">std</span>::endl;

    <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">0</span>;
<span style="color: #ffffff;">}</span>
</pre>
</div>

<iframe width="800" height="500" frameborder="0" src="https://pythontutor.com/iframe-embed.html#code=%23include%20%3Ciostream%3E%0A%0Aint%20main%28int%20argc,%20char%20**argv%29%0A%7B%0A%20%20%20%20//%20double%20x1%20%3D%209.87,%20y1%20%3D%20-0.65,%20z1%20%3D%207.65432%3B%0A%20%20%20%20//%20double%20x2%20%3D%20-5.432,%20y2%20%3D%20-0.6598876,%20z2%20%3D%20-0.64359%3B%0A%20%20%20%20//std%3A%3Acout%20%3C%3C%20x1*x2%20%2B%20y1*y2%20%2B%20z1*z2%20%3C%3C%20std%3A%3Aendl%3B%0A%0A%20%20%20%20//%20memoria%20%3D%20stack%28estatico%29%20%2B%20heap%28dinamica%29%0A%0A%20%20%20%20//%20primitive%20arrays%20//limited%20by%20stack%20size%0A%20%20%20%20int%20N%20%3D%2010000%3B%0A%20%20%20%20double%20v1%5BN%5D%7B9.87,%20-0.65,%207.65432%7D,%20v2%5BN%5D%7B-5.432,%20-0.6598876,%20-0.64359%7D%3B%0A%20%20%20%20double%20dot%20%3D%200%3B%0A%20%20%20%20for%20%28int%20ii%20%3D%200%3B%20ii%20%3C%20N%3B%20ii%2B%2B%29%20%7B%0A%20%20%20%20%20%20%20%20dot%20%2B%3D%20v1%5Bii%5D*v2%5Bii%5D%3B%0A%20%20%20%20%7D%0A%20%20%20%20std%3A%3Acout%20%3C%3C%20dot%20%3C%3C%20std%3A%3Aendl%3B%0A%0A%20%20%20%20return%200%3B%0A%7D&codeDivHeight=400&codeDivWidth=350&curInstr=0&origin=opt-frontend.js&py=cpp_g%2B%2B9.3.0&rawInputLstJSON=%5B%5D"> </iframe>
</div>
</div>

<div id="outline-container-orgba127f4" class="outline-2">
<h2 id="orgba127f4"><span class="section-number-2">2.</span> <span class="todo TODO">TODO</span> Pointers basic <code>[/]</code></h2>
<div class="outline-text-2" id="text-2">
<p>
Goal: to learn what a pointer is (a variable that stores a memory address) and
its relationship with primitive arrays
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ff9077;">#include</span> <span style="color: #ffffff;">&lt;</span><span style="color: #79a8ff;">iostream</span><span style="color: #ffffff;">&gt;</span>

<span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">argc</span>, <span style="color: #6ae4b9;">char</span> *<span style="color: #00d3d0;">argv</span><span style="color: #ff62d4;">[]</span><span style="color: #ffffff;">)</span> <span style="color: #ffffff;">{</span>
    <span style="color: #6ae4b9;">double</span> <span style="color: #00d3d0;">val</span> = <span style="color: #00bcff;">0.987766</span>;
    <span style="color: #6ae4b9;">double</span> * <span style="color: #00d3d0;">ptr</span> = <span style="color: #00bcff;">nullptr</span>; <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">pointer. Only stores memory addresses</span>
    ptr = &amp;val; <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">ptr stores x memory address</span>
    <span style="color: #a8a8a8;">//</span><span style="color: #a8a8a8;">ptr = x; // error, cannot store common values</span>
    <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"val : "</span> &lt;&lt; val  &lt;&lt; <span style="color: #00bcff;">std</span>::endl;
    <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"&amp;val: "</span> &lt;&lt; &amp;val &lt;&lt; <span style="color: #00bcff;">std</span>::endl;
    <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"ptr : "</span> &lt;&lt; ptr  &lt;&lt; <span style="color: #00bcff;">std</span>::endl; <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">prints val address</span>
    <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"*ptr: "</span> &lt;&lt; *ptr &lt;&lt; <span style="color: #00bcff;">std</span>::endl; <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">prints val VALUE</span>
    <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"&amp;ptr: "</span> &lt;&lt; &amp;ptr &lt;&lt; <span style="color: #00bcff;">std</span>::endl; <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">prints ptr address</span>
    
    <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">0</span>;
<span style="color: #ffffff;">}</span>
</pre>
</div>


<p>
C++/Python tutor visualization
</p>
<iframe width="800" height="500" frameborder="0" src="https://pythontutor.com/iframe-embed.html#code=%23include%20%3Ciostream%3E%0A%0Aint%20main%28int%20argc,%20char%20*argv%5B%5D%29%20%7B%0A%20%20%20%20double%20val%20%3D%200.987766%3B%0A%20%20%20%20double%20*%20ptr%20%3D%20nullptr%3B%20//%20pointer.%20Only%20stores%20memory%20addresses%0A%20%20%20%20ptr%20%3D%20%26val%3B%20//%20ptr%20stores%20x%20memory%20address%0A%20%20%20%20//ptr%20%3D%20x%3B%20//%20error,%20cannot%20store%20common%20values%0A%20%20%20%20std%3A%3Acout%20%3C%3C%20%22val%20%3A%20%22%20%3C%3C%20val%20%20%3C%3C%20std%3A%3Aendl%3B%0A%20%20%20%20std%3A%3Acout%20%3C%3C%20%22%26val%3A%20%22%20%3C%3C%20%26val%20%3C%3C%20std%3A%3Aendl%3B%0A%20%20%20%20std%3A%3Acout%20%3C%3C%20%22ptr%20%3A%20%22%20%3C%3C%20ptr%20%20%3C%3C%20std%3A%3Aendl%3B%20//%20prints%20val%20address%0A%20%20%20%20std%3A%3Acout%20%3C%3C%20%22*ptr%3A%20%22%20%3C%3C%20*ptr%20%3C%3C%20std%3A%3Aendl%3B%20//%20prints%20val%20VALUE%0A%20%20%20%20std%3A%3Acout%20%3C%3C%20%22%26ptr%3A%20%22%20%3C%3C%20%26ptr%20%3C%3C%20std%3A%3Aendl%3B%20//%20prints%20ptr%20address%0A%20%20%20%20%0A%20%20%20%20return%200%3B%0A%7D%0A&codeDivHeight=400&codeDivWidth=350&curInstr=0&origin=opt-frontend.js&py=cpp_g%2B%2B9.3.0&rawInputLstJSON=%5B%5D"> </iframe>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <p>
Modify the previous code to include a pointer
</p>
<div class="org-src-container">
<pre class="src src-cpp">  <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">Computing dot product</span>
<span style="color: #ff9077;">  #include</span> <span style="color: #ffffff;">&lt;</span><span style="color: #79a8ff;">iostream</span><span style="color: #ffffff;">&gt;</span>

  <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">argc</span>, <span style="color: #6ae4b9;">char</span> **<span style="color: #00d3d0;">argv</span><span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">{</span>
      <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">double x1 = 9.87, y1 = -0.65, z1 = 7.65432;</span>
      <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">double x2 = -5.432, y2 = -0.6598876, z2 = -0.64359;</span>
      <span style="color: #a8a8a8;">//</span><span style="color: #a8a8a8;">std::cout &lt;&lt; x1*x2 + y1*y2 + z1*z2 &lt;&lt; std::endl;</span>

      <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">memoria = stack(estatico) + heap(dinamica)</span>

      <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">primitive arrays //limited by stack size</span>
      <span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">N</span> = <span style="color: #00bcff;">10000</span>;
      <span style="color: #6ae4b9;">double</span> <span style="color: #00d3d0;">v1</span><span style="color: #ff62d4;">[</span>N<span style="color: #ff62d4;">]{</span><span style="color: #00bcff;">9.87</span>, -<span style="color: #00bcff;">0.65</span>, <span style="color: #00bcff;">7.65432</span><span style="color: #ff62d4;">}</span>;
      <span style="color: #6ae4b9;">double</span> * <span style="color: #00d3d0;">ptr</span> = <span style="color: #00bcff;">nullptr</span>;
      ptr = &amp;v1<span style="color: #ff62d4;">[</span><span style="color: #00bcff;">0</span><span style="color: #ff62d4;">]</span>;
      <span style="color: #00bcff;">std</span>::cout &lt;&lt; v1<span style="color: #ff62d4;">[</span><span style="color: #00bcff;">0</span><span style="color: #ff62d4;">]</span> &lt;&lt; <span style="color: #00bcff;">std</span>::endl;
      <span style="color: #00bcff;">std</span>::cout &lt;&lt; &amp;v1<span style="color: #ff62d4;">[</span><span style="color: #00bcff;">0</span><span style="color: #ff62d4;">]</span> &lt;&lt; <span style="color: #00bcff;">std</span>::endl;
      <span style="color: #00bcff;">std</span>::cout &lt;&lt; &amp;v1<span style="color: #ff62d4;">[</span><span style="color: #00bcff;">1</span><span style="color: #ff62d4;">]</span> &lt;&lt; <span style="color: #00bcff;">std</span>::endl;
      <span style="color: #00bcff;">std</span>::cout &lt;&lt; ptr &lt;&lt; <span style="color: #00bcff;">std</span>::endl;
      <span style="color: #00bcff;">std</span>::cout &lt;&lt; ptr<span style="color: #ff62d4;">[</span><span style="color: #00bcff;">0</span><span style="color: #ff62d4;">]</span> &lt;&lt; <span style="color: #00bcff;">std</span>::endl;
      <span style="color: #00bcff;">std</span>::cout &lt;&lt; ptr<span style="color: #ff62d4;">[</span><span style="color: #00bcff;">1</span><span style="color: #ff62d4;">]</span> &lt;&lt; <span style="color: #00bcff;">std</span>::endl;
      <span style="color: #00bcff;">std</span>::cout &lt;&lt; *<span style="color: #ff62d4;">(</span>ptr + <span style="color: #00bcff;">2</span><span style="color: #ff62d4;">)</span> &lt;&lt; <span style="color: #00bcff;">std</span>::endl;

      <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">0</span>;
  <span style="color: #ffffff;">}</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgadca18a" class="outline-2">
<h2 id="orgadca18a"><span class="section-number-2">3.</span> <span class="todo TODO">TODO</span> Passing arrays to functions <code>[0/3]</code></h2>
<div class="outline-text-2" id="text-3">
<p>
Goal: create functions and pass arrays by reference.
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Let&rsquo;s create a function that receives our vectors and returns their dot
product.</li>
<li class="off"><code>[&#xa0;]</code> Also create a function to initialize the vectors</li>
<li class="off"><code>[&#xa0;]</code> Create a function  print them, using the auto keyword.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc99ba97" class="outline-2">
<h2 id="orgc99ba97"><span class="section-number-2">4.</span> <span class="todo TODO">TODO</span> Talk about dynamic memory <code>[/]</code></h2>
<div class="outline-text-2" id="text-4">
<p>
Goal: Learn how to use <code>new</code> and <code>delete</code>
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <p>
Create a dynamic array with size read from the command line args. Check
memory comsumption
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ff9077;">#include</span> <span style="color: #ffffff;">&lt;</span><span style="color: #79a8ff;">iostream</span><span style="color: #ffffff;">&gt;</span>

<span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">argc</span>, <span style="color: #6ae4b9;">char</span> *<span style="color: #00d3d0;">argv</span><span style="color: #ff62d4;">[]</span><span style="color: #ffffff;">)</span> <span style="color: #ffffff;">{</span>
    <span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">N</span> = <span style="color: #00bcff;">std</span>::atoi<span style="color: #ff62d4;">(</span>argv<span style="color: #3fdfd0;">[</span><span style="color: #00bcff;">1</span><span style="color: #3fdfd0;">]</span><span style="color: #ff62d4;">)</span>;
    <span style="color: #6ae4b9;">double</span> * <span style="color: #00d3d0;">data</span> = <span style="color: #00bcff;">nullptr</span>;
    data = <span style="color: #b6a0ff;">new</span> <span style="color: #6ae4b9;">double</span> <span style="color: #ff62d4;">[</span>N<span style="color: #ff62d4;">]</span>; <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">ask for memory</span>
    <span style="color: #b6a0ff;">for</span><span style="color: #ff62d4;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">ii</span> = <span style="color: #00bcff;">0</span>; ii &lt; N; ++ii<span style="color: #ff62d4;">)</span> <span style="color: #ff62d4;">{</span>
        data<span style="color: #3fdfd0;">[</span>ii<span style="color: #3fdfd0;">]</span> = <span style="color: #00bcff;">2</span>*ii/<span style="color: #3fdfd0;">(</span><span style="color: #00bcff;">2</span>*ii + <span style="color: #00bcff;">1.0</span><span style="color: #3fdfd0;">)</span>;
    <span style="color: #ff62d4;">}</span>
    <span style="color: #00bcff;">std</span>::cout &lt;&lt; data<span style="color: #ff62d4;">[</span>N/<span style="color: #00bcff;">2</span><span style="color: #ff62d4;">]</span> &lt;&lt; <span style="color: #00bcff;">std</span>::endl;
    
    <span style="color: #b6a0ff;">delete</span> <span style="color: #ff62d4;">[]</span> data; <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">return memory</span>
    
    <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">0</span>;
<span style="color: #ffffff;">}</span>
</pre>
</div></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: William Oquendo</p>
<p class="date">Created: 2021-11-18 Thu 19:56</p>
</div>
</body>
</html>
